app/controllers/books_controller.rb

  def delete
    @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at", "author", "price", "published") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Hatchet"], ["created_at", "2022-09-14 02:00:17.248868"], ["updated_at", "2022-09-14 02:00:17.248868"], ["author", "Gary Paulsen"], ["price", 0.08], ["published", "2022-08-31"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "title" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["title", "Hatchet"], ["updated_at", "2022-09-11 21:31:59.360319"], ["id", 39]]